tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/app/cmd_shell.c
static void cmd_sys_ps(int argc, char **argv)
{
    uint8_t ps_mode;

    if (argc == 2) {
        ps_mode = atoi(argv[1]);
        if (ps_mode == 1) {
            sys_ps_set(SYS_PS_DEEP_SLEEP);
        } else if (ps_mode == 0) {
            sys_ps_set(SYS_PS_OFF);
        } else {
            goto Usage;
        }
        // info wifi system power mode change
#ifdef CFG_WLAN_SUPPORT
        wifi_core_task_resume(false);
#endif
        return;
    }
    ps_mode = sys_ps_get();

    app_print("Current power save mode: %d\n\r", ps_mode);

Usage:
    app_print("Usage: sys_ps [mode]\n\r");
    app_print("\tmode: 0: None, 1: CPU Deep Sleep\r\n");
}

static void cmd_ps_stats(int argc, char **argv)
{
    uint32_t cpu_sleep_time, cpu_stats_time;
    uint32_t sleep_int, sleep_frac;
    uint32_t stats_time, doze_time;
    uint32_t doze_int, doze_frac;

    if (argc != 1) {
        goto Usage;
    } else {
        sys_cpu_sleep_time_get(&cpu_stats_time, &cpu_sleep_time);
        app_print("cpu_sleep_time: %u\r\n", cpu_sleep_time);
        app_print("cpu_stats_time: %u\r\n", cpu_stats_time);
        sleep_int = ((cpu_sleep_time * 100) / cpu_stats_time);
        sleep_frac = (((cpu_sleep_time * 100) % cpu_stats_time) * 10) / cpu_stats_time;
        app_print("cpu sleep: %u.%u\r\n", sleep_int, sleep_frac);
#ifdef CFG_WLAN_SUPPORT
        wifi_netlink_sys_stats_get(&doze_time, &stats_time);
        app_print("doze_time: %u\r\n", doze_time);
        app_print("stats_time: %u\r\n", stats_time);
        doze_int = ((doze_time * 100) / stats_time);
        doze_frac = (((doze_time * 100) % stats_time) * 10) / stats_time;
        app_print("wifi doze: %u.%u\r\n", doze_int, doze_frac);
#endif
    }
    return;

Usage:
    app_print("Usage: ps_stats\n\r");
}

static void cmd_xmodem(int argc, char **argv)
{
    int ret;
    uint8_t xmodem_flag = 1;

    ret = rom_sys_status_set(SYS_XMODEM_FLAG, 1, &xmodem_flag);
    if (ret < 0) {
        app_print("rom sys status set fail\r\n");
        return;
    }
    printf("\r\n#");
    SysTimer_SoftwareReset();
}

/**
 ****************************************************************************************
 * @brief Process function for 'cpu_stats' command
 *
 * @param[in] params Not used
 * @return 0 on success and !=0 if error occurred
 ****************************************************************************************
 */
static void cmd_cpu_stats(int argc, char **argv)
{
    sys_cpu_stats();
}

static void cmd_read_memory(int argc, char **argv)
{
    char *endptr = NULL;
    uint32_t addr = 0;
    uint32_t count = 4;
    uint32_t width = 4;

    if (argc > 1) {
        addr = (uint32_t)strtoul((const char *)argv[1], &endptr, 16);
        if (*endptr != '\0') {
            app_print("rmem: invalid address\r\n");
            goto exit;
        }
    }
    if (argc > 2) {
        count = (uint32_t)strtoul((const char *)argv[2], &endptr, 0);
        if (*endptr != '\0') {
            app_print("rmem: invalid count\r\n");
            goto exit;
        }
    }
    if (argc > 3) {
        width = (uint32_t)strtoul((const char *)argv[3], &endptr, 0);
        if (*endptr != '\0') {
            app_print("rmem: invalid width\r\n");
            goto exit;
        }
    }

    print_buffer(addr, (void *)addr, width, count, 0);
    return;
exit:
    app_print("Usage: rmem <addr> [count] [width]\r\n");
}

#if LWIP_STATS && LWIP_STATS_DISPLAY
static void cmd_lwip_stats(int argc, char **argv)
{
    stats_display();
}
#endif

static void cmd_group_join(int argc, char **argv)
{
    if (argc == 2) {
        int vif_idx = WIFI_VIF_INDEX_DEFAULT;
        ip4_addr_t group_ip;
        struct netif *net_if = NULL;

        if (inet_aton((char *)argv[1], (struct in_addr*)&group_ip) == 0) {
            app_print("\rCan not join group because of group IP error\r\n");
            goto usage;
        }

        if (!ip4_addr_ismulticast(&group_ip)) {
            app_print("ip is not a multicast ip\r\n");
            goto usage;
        }

        net_if = (struct netif *)vif_idx_to_net_if(vif_idx);
        if (!net_if) {
            app_print("no netif found for interface:%d", vif_idx);
            return;
        }
        if (net_dhcp_address_obtained(net_if) || net_if_is_static_ip()) {
            igmp_joingroup((const ip4_addr_t *)&net_if->ip_addr, (const ip4_addr_t *)&group_ip);
        } else {
            app_print("Can not join group because IP not got\r\n");
        }
        return;
    }
usage:
    app_print("Usage: join_group <group ip eg:224.0.0.5>\r\n");
}

static void cmd_wifi_debug(int argc, char **argv)
{
    char *endptr = NULL;
    uint32_t enable = 0;

    if (argc == 2) {
        enable = (uint32_t)strtoul((const char *)argv[1], &endptr, 0);
        if (*endptr != '\0') {
            goto usage;
        }
        if (enable != 0 && enable != 1)
            goto usage;
        if (enable)
            wifi_netlink_dbg_open();
        else
            wifi_netlink_dbg_close();
    } else {
        goto usage;
    }
    return;

usage:
    app_print("Usage: wifi_debug <0 or 1>\r\n");
}

static void cmd_wifi_open(int argc, char **argv)
{
    wifi_netlink_wifi_open();
}

static void cmd_wifi_close(int argc, char **argv)
{
    wifi_netlink_wifi_close();
}

static void cmd_wifi_mac_addr(int argc, char **argv)
{
    uint8_t *addr;
    uint8_t user_addr[WIFI_ALEN];

    if(argc == 1) {
        addr = wifi_vif_mac_addr_get(WIFI_VIF_INDEX_DEFAULT);
        app_print("Wi-Fi MAC Address: "MAC_FMT"\r\n", MAC_ARG_UINT8(addr));
        goto Usage;
    } else if(argc == 2) {
        if (cli_parse_macaddr(argv[1], user_addr)) {
            app_print("MAC address is not valid.\r\n");
            goto Usage;
        }

        app_print("User MAC: "MAC_FMT"\r\n", MAC_ARG_UINT8(user_addr));
        if (user_addr[0] & 0x01) {
            app_print("The LSB of the first byte of the MAC must be 0.\r\n" );
            return;
        }
        wifi_vif_user_addr_set(user_addr);
        app_print("Please enter wifi_close and wifi_open to take effect.\r\n");
    } else {
        goto Usage;
    }
    return;
Usage:
    app_print("\rUsage: wifi_mac_addr [xx:xx:xx:xx:xx:xx]\r\n");
}

#ifdef CFG_WIFI_CONCURRENT
static void cmd_wifi_concurrent(int argc, char **argv)
{
    char *endptr = NULL;
    uint32_t enable = 0;

