tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/app/cmd_shell.c
    if (argc == 2) {
        enable = (uint32_t)strtoul((const char *)argv[1], &endptr, 0);
        if (*endptr != '\0') {
            goto usage;
        }
        if (enable != 0 && enable != 1) {
            goto usage;
        }
        wifi_management_concurrent_set(enable);
    } else if (argc == 1) {
        app_print("wifi concurrent mode %d\r\n", wifi_management_concurrent_get());
    } else {
        goto usage;
    }
    return;

usage:
    app_print("Usage: wifi_concurrent [0 or 1]\r\n");
}
#endif /* CFG_WIFI_CONCURRENT */

static void cb_scan_done(void *eloop_data, void *user_ctx)
{
    app_print("WIFI_SCAN: done\r\n");
    wifi_netlink_scan_results_print(WIFI_VIF_INDEX_DEFAULT, wifi_netlink_scan_result_print);
    eloop_event_unregister(WIFI_MGMT_EVENT_SCAN_DONE, cb_scan_done);
    eloop_event_unregister(WIFI_MGMT_EVENT_SCAN_FAIL, cb_scan_fail);
}

static void cb_scan_fail(void *eloop_data, void *user_ctx)
{
    app_print("WIFI_SCAN: failed\r\n");
    eloop_event_unregister(WIFI_MGMT_EVENT_SCAN_DONE, cb_scan_done);
    eloop_event_unregister(WIFI_MGMT_EVENT_SCAN_FAIL, cb_scan_fail);
}

static void cmd_wifi_scan(int argc, char **argv)
{
#if 1
    eloop_event_register(WIFI_MGMT_EVENT_SCAN_DONE, cb_scan_done, NULL, NULL);
    eloop_event_register(WIFI_MGMT_EVENT_SCAN_FAIL, cb_scan_fail, NULL, NULL);

    if (wifi_management_scan(false, NULL)) {
        eloop_event_unregister(WIFI_MGMT_EVENT_SCAN_DONE, cb_scan_done);
        eloop_event_unregister(WIFI_MGMT_EVENT_SCAN_FAIL, cb_scan_fail);
        app_print("Wifi scan failed\r\n");
    }
#else
    if (wifi_management_scan(true, NULL) != 0) {
        app_print("start wifi_scan failed\r\n");
    } else {
        wifi_netlink_scan_results_print(WIFI_VIF_INDEX_DEFAULT, wifi_netlink_scan_result_print);
    }
#endif
}

/**
 ****************************************************************************************
 * @brief Process function for 'connect' command
 *
 * Start connection to an AP in a separated task.
 * @verbatim
   wifi_connect <SSID> [password]
   @endverbatim
 *
 * @param[in] params <ssid> [password]
 * @return
 ****************************************************************************************
 */
static void cb_connect_success(void *eloop_data, void *user_ctx)
{
    app_print("WIFI_CONNECT: success\r\n");

    eloop_event_unregister(WIFI_MGMT_EVENT_CONNECT_SUCCESS, cb_connect_success);
    eloop_event_unregister(WIFI_MGMT_EVENT_CONNECT_FAIL, cb_connect_fail);
}

static void cb_connect_fail(void *eloop_data, void *user_ctx)
{
    app_print("WIFI_CONNECT: fail\r\n");

    eloop_event_unregister(WIFI_MGMT_EVENT_CONNECT_SUCCESS, cb_connect_success);
    eloop_event_unregister(WIFI_MGMT_EVENT_CONNECT_FAIL, cb_connect_fail);
}

static void cmd_wifi_connect(int argc, char **argv)
{
    int status = 0;
    char *ssid;
    char *password;

    if(argc == 2) {
        ssid = argv[1];
        password = NULL;
    } else if(argc == 3) {
        ssid = argv[1];
        password = argv[2];
    } else {
        app_print("\rUsage: wifi_connect <SSID> [PASSWORD]\r\n");
        return;
    }
#if 1
    status = wifi_management_connect(ssid, password, true);
#else
    eloop_event_register(WIFI_MGMT_EVENT_CONNECT_SUCCESS, cb_connect_success, NULL, NULL);
    eloop_event_register(WIFI_MGMT_EVENT_CONNECT_FAIL, cb_connect_fail, NULL, NULL);

    status = wifi_management_connect(ssid, password, false);
#endif

    if (status != 0) {
        app_print("start wifi_connect failed %d\r\n", status);
    }
}

static void cmd_wifi_connect_bssid(int argc, char **argv)
{
    int status = 0;
    char *string_bssid;
    uint8_t bssid[WIFI_ALEN];
    char *password;

    if (argc == 2) {
        string_bssid = argv[1];
        password = NULL;
    } else if (argc == 3) {
        string_bssid = argv[1];
        password = argv[2];
    } else {
        goto Usage;
    }
    if (cli_parse_macaddr(string_bssid, bssid)) {
        app_print("BSSID is not valid.\r\n");
        goto Usage;
    }

    app_print("bssid: "MAC_FMT"\r\n", MAC_ARG_UINT8(bssid));
    if (bssid[0] & 0x01) {
        app_print("The LSB of the first byte of the BSSID must be 0.\r\n" );
        return;
    }
    status = wifi_management_connect_with_bssid(bssid, password, true);

    if (status != 0) {
        app_print("start wifi_connect_bssid failed %d\r\n", status);
    }
    return;

Usage:
    app_print("\rUsage: wifi_connect_bssid <BSSID> [PASSWORD]\r\n");
}

#ifdef CFG_8021x_EAP_TLS
static void cmd_wifi_connect_eap_tls(int argc, char **argv)
{
    int status = 0;
    char *ssid;

    if (argc == 2) {
        ssid = argv[1];
    } else {
        app_print("\rUsage: wifi_connect_eap_tls <SSID>\r\n");
        return;
    }

    status = wifi_management_connect_with_eap_tls(ssid, identity, ca_cert,
                                                client_key, client_cert,
                                                client_key_password, phase1, true);

    if (status != 0) {
        app_print("start wifi_connect_eap_tls failed %d\r\n", status);
    }
}
#endif

static void cmd_wifi_disconnect(int argc, char **argv)
{
    wifi_management_disconnect();
    return;
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_status' command
 *
 * @param[in] params not used
 *
 * @return
 ****************************************************************************************
 */
static void cmd_wifi_status(int argc, char **argv)
{
    wifi_netlink_status_print();
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_set_ip' command
 *
   @verbatim
      wifi_set_ip dhcp
      wifi_set_ip <ip> <gw>
   @endverbatim
 *
 * @param[in] params 'dhcp' | <ip> <gw>
 * @return
 ****************************************************************************************
 */
static void cmd_wifi_ip_set(int argc, char **argv)
{
    int vif_idx = WIFI_VIF_INDEX_DEFAULT;
    struct wifi_vif_tag *wvif = vif_idx_to_wvif(vif_idx);
    struct wifi_ip_addr_cfg ip_cfg;

