tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/app/cmd_shell.c
    if (argc == 2) {
        if (strcmp(argv[1], "dhcp") == 0) {
            /* Only STA mode */
            if (wvif->wvif_type != WVIF_STA) {
                app_print("wifi_set_ip: only for STA mode\r\n");
                goto usage;
            }
            /* if ip has been get before, clear it and get a new one */
            net_if_use_static_ip(false);
            ip_cfg.mode = IP_ADDR_NONE;
            wifi_set_vif_ip(vif_idx, &ip_cfg);

            ip_cfg.mode = IP_ADDR_DHCP_CLIENT;
            ip_cfg.default_output = true;
            ip_cfg.dhcp.to_ms = VIF_DHCP_TIMEOUT;

            if (wifi_set_vif_ip(vif_idx, &ip_cfg)) {
                app_print("wifi_set_ip: dhcpc failed\n");
            }
        } else {
            goto usage;
        }
    } else if (argc == 3) {
        /* Only STA mode */
        if (wvif->wvif_type != WVIF_STA) {
            app_print("wifi_set_ip: only for STA mode\r\n");
            goto usage;
        }
        app_print("wifi_set_ip: set ip addr:%s, gate_way:%s\r\n", (char *)argv[1], (char *)argv[2]);
        ip_cfg.mode = IP_ADDR_STATIC_IPV4;
        ip_cfg.ipv4.dns = 0;
        net_if_use_static_ip(true);

        if (cli_parse_ip4((char *)argv[1], &ip_cfg.ipv4.addr, &ip_cfg.ipv4.mask) != 0)
            goto usage;

        if (cli_parse_ip4((char *)argv[2], &ip_cfg.ipv4.gw, NULL))
            goto usage;

        if (wifi_set_vif_ip(vif_idx, &ip_cfg)) {
            app_print("wifi_set_ip: failed to set ip\r\n");
        }
    } else if (argc == 4) {
        if (strcmp(argv[1], "dhcpd") == 0) {
            /* Only SoftAP mode */
            if (wvif->wvif_type != WVIF_AP) {
                app_print("wifi_set_ip: only for AP mode\r\n");
                goto usage;
            }

            ip_cfg.mode = IP_ADDR_DHCP_SERVER;
            if (cli_parse_ip4((char *)argv[2], &ip_cfg.ipv4.addr, &ip_cfg.ipv4.mask) != 0)
                goto usage;

            if (cli_parse_ip4((char *)argv[3], &ip_cfg.ipv4.gw, NULL))
                goto usage;

            if (wifi_set_vif_ip(vif_idx, &ip_cfg)) {
                app_print("wifi_set_ip: failed to set dhcpd\r\n");
            }
        } else {
            goto err_input;
        }
    } else {
        goto err_input;
    }
    return;

err_input:
    app_print("wifi_set_ip: invalid input\r\n");
usage:
    app_print("Usage: wifi_set_ip dhcp | <ip_addr/mask_bits> <gate_way> | dhcpd <ip_addr/mask_bits> <gate_way>\r\n");
    app_print("\tdhcp: get ip by start dhcp, only for STA mode\r\n");
    app_print("\tip_addr: ipv4 addr to set.\r\n");
    app_print("\tgate_way: gate way to set.\r\n");
    app_print("\tdhcpd: use new ip addr to restart dhcp server, only for SoftAP mode\r\n");
    app_print("Example: wifi_set_ip 192.168.0.123/24 192.168.0.1\r\n");
    app_print("         wifi_set_ip dhcp\r\n");
    app_print("         wifi_set_ip dhcpd 192.168.0.1/24 192.168.0.1\r\n");
    return;
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_auto_conn' command
 *
   @verbatim
      wifi_auto_conn 1/0 or wifi_auto_conn
   @endverbatim
 *
 * @param[in] [auto_conn]
 * @return
 ****************************************************************************************
 */
static void cmd_wifi_auto_conn(int argc, char **argv)
{
    char *endptr = NULL;
    uint32_t enable = 0;

    if (argc == 2) {
        enable = (uint32_t)strtoul((const char *)argv[1], &endptr, 0);
        if (*endptr != '\0') {
            goto usage;
        }
        if (enable != 0 && enable != 1) {
            goto usage;
        }
        wifi_netlink_auto_conn_set(enable);
    } else if (argc == 1) {
        app_print("Current wifi auto conn %d\r\n", wifi_netlink_auto_conn_get());
        return;
    } else {
        goto usage;
    }
    return;

usage:
    app_print("Usage: wifi_auto_conn [0 or 1]\r\n");
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_wireless_mode' command
 *
   @verbatim
      wifi_wireless_mode bg/bgn/bgn_ax or wifi_wireless_mode
   @endverbatim
 *
 * @param[in] [mode]
 * @return
 ****************************************************************************************
 */
static void cmd_wifi_wireless_mode(int argc, char **argv)
{
    uint32_t wireless_mode = WIRELESS_MODE_UNKNOWN;
    uint32_t vif_idx = WIFI_VIF_INDEX_DEFAULT;
    struct wifi_vif_tag *wvif = vif_idx_to_wvif(vif_idx);

    if (wvif->wvif_type != WVIF_STA) {
        app_print("Only for STA mode.\r\n");
        return;
    }

    if (argc == 2) {
        if (strncmp(argv[1], "bgnax", 5) == 0) {
            wireless_mode = WIRELESS_MODE_11BGN_AX;
        } else if (strncmp(argv[1], "bgn", 3) == 0) {
            wireless_mode = WIRELESS_MODE_11BGN;
        } else if (strncmp(argv[1], "bg", 2) == 0) {
            wireless_mode = WIRELESS_MODE_11BG;
        }
        if (wireless_mode == WIRELESS_MODE_UNKNOWN) {
            app_print("Input wireless mode error.\r\n");
            goto Usage;
        }
        macif_vif_wireless_mode_set(wireless_mode);
        app_print("Please enter wifi_close and wifi_open to take effect.\r\n");
    } else if (argc == 1) {
        wireless_mode = macif_vif_wireless_mode_get(vif_idx);
        app_print("Current wireless mode: ");
        wifi_netlink_wireless_mode_print(wireless_mode);
        return;
    } else {
        goto Usage;
    }
    return;

Usage:
    app_print("Usage: wifi_wireless_mode [bg or bgn or bgnax]\r\n");
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_roaming' command
 *
   @verbatim
      wifi_roaming 1/0 rss_threshold or wifi_roaming
   @endverbatim
 *
 * @param[in] [enable] [rssi_threshold]
 * @return
 ****************************************************************************************
 */
static void cmd_wifi_roaming(int argc, char **argv)
{
    uint32_t vif_idx = WIFI_VIF_INDEX_DEFAULT;
    struct wifi_vif_tag *wvif = vif_idx_to_wvif(vif_idx);
    uint8_t enable = 0;
    int8_t rssi_th = 0;

    if (wvif->wvif_type != WVIF_STA) {
        app_print("Only for STA mode.\r\n");
        return;
    }

