tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/app/cmd_shell.c
    if (argc >= 3) {
        rssi_th = atoi(argv[2]);
        if (rssi_th >= 0) {
            app_print("RSSI threshold must be less than 0.\r\n");
            return;
        }
    }

    if (argc >= 2) {
        enable = atoi(argv[1]) ? 1 : 0;
        wifi_management_roaming_set(enable, rssi_th);
    } else if (argc == 1) {
        enable = wifi_management_roaming_get(&rssi_th);
        if (enable)
            app_print("wifi roaming enable: 1, rssi th %d\r\n", rssi_th);
        else
            app_print("wifi roaming enable: 0\r\n");
        goto Usage;
    }
    return;

Usage:
    app_print("Usage: wifi_roaming [enable] [rssi_threshold]\r\n");
    app_print("Example: wifi_roaming 1 -70\r\n");
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_ps' command
 *
 * Enable/disable power save mode.
 * @verbatim
   wifi_ps <mode>
   @endverbatim
 *
 * @param[in] params  PS parameters
 * @return none
 ****************************************************************************************
 */
static void cmd_wifi_ps(int argc, char **argv)
{
    uint32_t mode_set;
    uint32_t vif_idx = WIFI_VIF_INDEX_DEFAULT;
    struct wifi_vif_tag *wvif = vif_idx_to_wvif(vif_idx);

    if (wvif->wvif_type != WVIF_STA) {
        app_print("Not STA mode, do nothing.\r\n");
        return;
    }

    do {
        if (argc < 2)
            break;

        mode_set = atoi(argv[1]);
        if (wifi_netlink_ps_mode_set(vif_idx, mode_set))
            app_print("wifi_ps: set failed\r\n");
        return;

    } while(0);

    app_print("Current ps mode: %u\r\n\r\n", wvif->sta.psmode);

    app_print("Usage: wifi_ps [mode]\n\r");
    app_print("\tmode: 0: off, 1: always on, 2: based on traffic detection\r\n");
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_listen_interval' command
 *
 * set listen beacon interval in power save mode
 * @verbatim
   wifi_listen_interval [interval]
   @endverbatim
 *
 * @param[in] params  listen interval
 * @return none
 ****************************************************************************************
 */
static void cmd_wifi_listen_interval_set(int argc, char **argv)
{
    uint32_t listen_interval;

    do {
        if (argc < 2)
            break;

        listen_interval = atoi(argv[1]);
        if (listen_interval > 10) {
            app_print("listen interval is too large\r\n");
            break;
        }

        if (wifi_netlink_listen_interval_set(listen_interval))
            app_print("wifi_listen_interval: set failed\r\n");

        return;
    } while(0);

    app_print("Usage: wifi_listen_interval [interval]\n\r");
    app_print("\tinterval: 0: listen beacon by dtim, 1 - 10 , the interval of listen beacon\r\n");
}

/**
 ****************************************************************************************
 * @brief Process function for 'wifi_ap' command
 *
 * Start an AP
 * @verbatim
   wifi_ap <ssid> <password> <channel> [-a <akm>[,<akm 2>]] [-hide <hide_ap>]
   @endverbatim
 * @param[in] params <ssid> <password> <channel> [-a <akm>[,<akm 2>]] [-hide <hide_ap>]
 * @return
 ****************************************************************************************
 */
#ifdef CFG_SOFTAP
static void cmd_wifi_ap(int argc, char **argv)
{
    char *ssid = NULL;
    char *password = NULL;
    uint32_t passwd_len = 0;
    uint8_t channel = 1, is_hidden = 0;
    wifi_ap_auth_mode_t auth_mode = AUTH_MODE_UNKNOWN;
    char *option, *akm_str = NULL;
    int arg_idx = 4;

    if ((argc < 4) || (argc & 1) == 1) {
        goto usage;
    }
    ssid = argv[1];
    password = argv[2];
    channel = atoi(argv[3]);

    while (arg_idx < argc) {
        option = argv[arg_idx];
        if (!strcmp("-a", option)) {
            akm_str = argv[arg_idx + 1];
        } else if (!strcmp("-hide", option)) {
            is_hidden = atoi(argv[arg_idx + 1]) > 0 ? 1 : 0;
        }
        arg_idx += 2;
    }

    passwd_len = strlen(password);
    if ((strlen(ssid) > WIFI_SSID_MAX_LEN)
        || (passwd_len < WPA_MIN_PSK_LEN && strcmp("NULL", password))
        || (passwd_len > WPA_MAX_PSK_LEN))
        goto usage;

    if (channel > 13 || channel < 1)
        goto usage;

    if (akm_str) {
        if (!strcmp(akm_str, "open"))
            auth_mode = AUTH_MODE_OPEN;
        else if (!strcmp(akm_str, "wpa2"))
            auth_mode = AUTH_MODE_WPA2;
        else if (!strcmp(akm_str, "wpa3"))
            auth_mode = AUTH_MODE_WPA3;
        else if (!strcmp(akm_str, "wpa2,wpa3") || !strcmp(akm_str, "wpa3,wpa2"))
            auth_mode = AUTH_MODE_WPA2_WPA3;
        else
            goto usage;
    }

    if (!strcmp(password, "NULL")) {
        auth_mode = AUTH_MODE_OPEN;
        password = NULL;
    } else if (auth_mode == AUTH_MODE_UNKNOWN || auth_mode == AUTH_MODE_OPEN) {
        // default use wpa2 mode;
        // or password has been entered, but a '-a open' followed, ignore -a option.
        auth_mode = AUTH_MODE_WPA2;
    }

    if (wifi_management_ap_start(ssid, password, channel, auth_mode, is_hidden)) {
        app_print("Failed to start AP, check your configuration.\r\n");
        return;
    }

    app_print("SoftAP successfully started!\r\n");
    return;
usage:
    app_print("Usage: wifi_ap <ssid> <password> <channel> [-a <akm>[,<akm 2>]] [-hide <hide_ap>]\r\n");
    app_print("<ssid>: The length should be between 1 and 32.\r\n");
    app_print("<password>: The length should be between 8 and 63, but can be \"NULL\" indicates open ap.\r\n");
    app_print("<channel>: 1~13.\r\n");
    app_print("[-a <akm>[,<akm 2>]]: only support following 5 AKM units: open; wpa2; wpa3; wpa2,wpa3 or wpa3,wpa2.\r\n");
    app_print("[-hide <hide_ap>]: 0 or 1, default 0.\r\n");
    app_print("For example:\r\n");
    app_print("    wifi_ap test_ap 12345678 1 -a wpa3 -hide 0, means a wpa3 ap in channel 1 and can broadcast ssid.\r\n");
    app_print("    wifi_ap test_ap NULL 5, means an open ap in channel 5.\r\n");
    app_print("    wifi_ap test_ap 12345678 11, means a wpa2 ap in channel 11, default wpa2.\r\n");
}

extern uint32_t dhcpd_find_ipaddr_by_macaddr(uint8_t *mac_addr);
static void cmd_wifi_ap_client_delete(int argc, char **argv)
{
    char *string_addr;
    uint8_t client_mac_addr[WIFI_ALEN];
    int vif_idx = WIFI_VIF_INDEX_DEFAULT;
    int ret = 0;

