tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/app/cmd_shell.c
    if (argc == 2) {
        string_addr = argv[1];
    } else {
        goto Usage;
    }

    if (cli_parse_macaddr(string_addr, client_mac_addr)) {
        app_print("Client mac addr is not valid.\r\n");
        goto Usage;
    }
    app_print("Client mac addr: "MAC_FMT"\r\n", MAC_ARG_UINT8(client_mac_addr));

#ifdef CFG_WIFI_CONCURRENT
    if (wifi_management_concurrent_get()) {
        vif_idx = WIFI_VIF_INDEX_SOFTAP_MODE;
    }
#endif
    if (!wifi_vif_is_softap(vif_idx)) {
        app_print("No SoftAP is started.\r\n");
        return;
    }
    if (dhcpd_find_ipaddr_by_macaddr(client_mac_addr) == 0) {
        app_print("Client is not connected to our SoftAP.\r\n");
        return;
    }

    ret = wifi_management_ap_delete_client(client_mac_addr);
    if (ret) {
        app_print("SoftAP disconnect to client "MAC_FMT" failed.\r\n", MAC_ARG_UINT8(client_mac_addr));
    }

    return;
Usage:
    app_print("\rUsage: wifi_ap_client_delete <client mac addr>\r\n");
}

static void cmd_wifi_ap_stop(int argc, char **argv)
{
    wifi_management_ap_stop();
}
#endif // CFG_SOFTAP

#ifdef CONFIG_SOFTAP_PROVISIONING
/*!
    \brief      stop wifi ap mode
    \param[in]  argc: number of parameters
    \param[in]  argv: the pointer to the array that holds the parameters
    \param[out] none
    \retval     none
*/
static void cmd_wifi_ap_provisioning(int argc, char **argv)
{
    int start;
    do {
        if (argc == 2) {
            start = atoi(argv[1]);
            if (start == 1) {
                wifi_softap_provisioning_start();
            } else if (start == 0) {
                wifi_softap_provisioning_stop();
            } else {
                break;
            }
            return;
        }
    } while (0);

    app_print("Usage: wifi_ap_provisioning [start]\r\n");
    app_print("\tstart: 1: start provisioning, 0: stop provisioning \r\n");
}
#endif

#ifdef CFG_TWT
static void cmd_wifi_twt_setup(int argc, char **argv)
{
    struct macif_twt_setup_t param;
    char *endptr = NULL;

    do {
        if (argc < 6)
            break;

        if (argc >= 7) {
            param.wake_dur_unit = (uint32_t)strtoul((const char *)argv[6], &endptr, 10);
            if ((*endptr != '\0'))
                break;
        } else {
            param.wake_dur_unit = 0;
        }

        param.setup_type = (uint32_t)strtoul((const char *)argv[1], &endptr, 10);
        if ((*endptr != '\0') || (param.setup_type > 2))
            break;

        param.flow_type = (uint32_t)strtoul((const char *)argv[2], &endptr, 10);
        if ((*endptr != '\0') || (param.flow_type > 1))
            break;

        param.wake_int_exp = (uint32_t)strtoul((const char *)argv[3], &endptr, 10);

        if ((*endptr != '\0') || (param.wake_int_exp > 31))
            break;

        param.wake_int_mantissa = (uint32_t)strtoul((const char *)argv[4], &endptr, 10);

        if ((*endptr != '\0') || (param.wake_int_mantissa == 0) || (param.wake_int_mantissa > 0xFFFF))
            break;

        param.min_twt_wake_dur = (uint32_t)strtoul((const char *)argv[5], &endptr, 10);
        if ((*endptr != '\0') || (param.min_twt_wake_dur > 255))
            break;

        wifi_netlink_twt_setup(WIFI_VIF_INDEX_DEFAULT, &param);

        return;
    } while(0);

    app_print("Invaild parameters!!\r\n");

    app_print("Usage: wifi_setup_twt <setup type> <flow> <wake interval exp>  <wake interval mantissa> <mini wake> [wake unit]\n\r");
    app_print("\tsetup type: 0: Request, 1: Suggest, 2: Demand\r\n");
    app_print("\tflow: 0: Announced, 1: Unannounced\r\n");
    app_print("\twake interval exp: TWT Wake Interval Exponent , 0 - 31\r\n");
    app_print("\twake interval mantissa: TWT Wake Interval mantissa, 1 - 0xFFFF\r\n");
    app_print("\t\tTWT Wake Interval = (wake interval mantissa) * 2^(wake interval exp) us\r\n");
    app_print("\tmini wake: max 255, Minimum TWT Wake Duration = (mini wake) * (wake unit)\r\n");
    app_print("\twake unit: 0:256us, 1:tu(1024us), default wake unit 0\r\n");

    return;
}

static void cmd_wifi_twt_teardown(int argc, char **argv)
{
    char *endptr = NULL;
    uint8_t id = 0;
    uint8_t neg_type = 0;

    if (argc < 2) {
        goto Usage;
    }

    if (argc >= 2) {
        id = (uint32_t)strtoul((const char *)argv[1], &endptr, 10);
        if (*endptr != '\0') {
            app_print("cmd_wifi_twt_teardown: invalid id\r\n");
            return;
        }
    }

    if (argc == 3) {
        neg_type = (uint32_t)strtoul((const char *)argv[2], &endptr, 10);
        if (*endptr != '\0') {
            app_print("cmd_wifi_twt_teardown: invalid negotiation type\r\n");
            return;
        }
    }

    wifi_netlink_twt_teardown(WIFI_VIF_INDEX_DEFAULT, id, neg_type);
    return;

Usage:
    app_print("Invaild parameters!!\r\n");
    app_print("Usage: wifi_teardown_twt <flow id> [negotiation type]\r\n");
    app_print("\tnegotiation type: default 0\r\n");
}
#endif /* CFG_TWT */
/**
 ****************************************************************************************
 * @brief Process function for 'wifi_monitor' command
 *
 * monitor command can be used to start the monitor mode
 *
   @verbatim
     wifi_monitor start <channel>
     wifi_monitor stop
   @endverbatim
 *
 * @param[in] params monitor_start/stop commands above
 ****************************************************************************************
 */
static void cmd_wifi_monitor(int argc, char **argv)
{
    char *option;
    uint8_t channel;

    if (argc == 3) {
        option = argv[1];
        if (!strcmp("start", option)) {
            channel = atoi(argv[2]);
            if (channel < 1 || channel > 14) {
                goto usage;
            }
            wifi_management_monitor_start(channel, NULL);
            return;
        }
    } else if (argc == 2) {
        option = argv[1];
        if (!strcmp("stop", option)) {
            struct wifi_vif_tag *wvif = &wifi_vif_tab[WIFI_VIF_INDEX_DEFAULT];

            if (wvif->wvif_type != WVIF_MONITOR) {
                app_print("not monitor mode, do nothing.\r\n");
                return;
            }

            /* stop monitor first, if the monitor is already started */
            wifi_management_sta_start();
            return;
        }
    }

usage:
    app_print("Usage: wifi_monitor stop | start <channel>\r\n");
    app_print("start: start the monitor mode.\r\n");
    app_print("<channel>: 1~14.\r\n");
    app_print("stop: stop the monitor mode.\r\n");
}

#ifdef CFG_WPS
/**
 ****************************************************************************************
 * @brief Process function for 'wps' command
 *
 * wps command can be used to connect with the AP using PBC mode or PIN mode
 *
   @verbatim
     wps pbc : connect with AP using WPS PBC mode
     wps pin pin_code : connect with AP using WPS PIN code.
   @endverbatim
 *
 * @param[in] params pbc/pin commands above
 ****************************************************************************************
 */
static void cmd_wifi_wps(int argc, char **argv)
{
    bool is_pbc = true;
    char *pin = NULL;
    int i, ret;

    if (argc == 1) {
        goto Usage;
    }
    if (argc >= 2) {
        if (strncmp(argv[1], "pbc", 3) == 0) {
            is_pbc = true;
        } else if (strncmp(argv[1], "pin", 3) == 0) {
            is_pbc = false;
        } else {
            app_print("WPS parameter error.\r\n");
            goto Usage;
        }
    }

    if (argc >= 3){
        pin = argv[2];
        if (strlen(pin) != 8) {
            app_print("WPS PIN code length is not 8.\r\n");
            goto Usage;
        }
        for (i = 0; i < strlen(pin); i++) {
            if (!('0' <= pin[i] && pin[i] <= '9')) {
                app_print("WPS PIN code must be all digit numbers.\r\n");
                goto Usage;
            }
        }
    }

    ret = wifi_management_wps_start(is_pbc, pin, true);
    if (ret) {
        app_print("WPS failed and return %d\r\n", ret);
    } else {
        app_print("WPS succeeded.\r\n");
    }
    return;
Usage:
    app_print("Usage: wifi_wps pbc | pin <pin code>\r\n");
    app_print("Example:\r\n");
    app_print("     : wifi_wps pbc\r\n");
    app_print("     : wifi_wps pin 43022618\r\n");
}
#endif /* CFG_WPS */

#ifdef CONFIG_OTA_DEMO_SUPPORT
static void cmd_ota_demo(int argc, char **argv)
{
    char *ssid;
    char *password;
    char *srv_addr;
    char *image_url;
    size_t key_len;
    size_t ssid_len;

