tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/app/cmd_shell.c
    if (argc == 4) {
        ssid_len = strlen(argv[1]);
        if (ssid_len <= MAC_SSID_LEN)
            ssid = argv[1];
        else
            goto usage;

        password = NULL;
        srv_addr = argv[2];
        image_url = argv[3];
    } else if (argc == 5) {
        ssid_len = strlen(argv[1]);
        if (ssid_len <= MAC_SSID_LEN)
            ssid = argv[1];
        else
            goto usage;

        key_len = strlen(argv[2]);
        if (key_len <= WPA_MAX_PSK_LEN && key_len >= WPA_MIN_PSK_LEN)
            password = argv[2];
        else
            goto usage;

        srv_addr = argv[3];
        image_url = argv[4];
    } else {
        goto usage;
    }

    if (wifi_management_connect(ssid, password, true)) {
        app_print("WiFi connect failed, OTA demo abort\r\n");
        return;
    }

    if (ota_demo_cfg_init(srv_addr, image_url))
        goto usage;

    ota_demo_start();

    return;
usage:
    app_print("Usage: ota_demo <ssid> [password] <srvaddr> <imageurl>\r\n");
    app_print("<ssid>: The length should be between 1 and 32.\r\n");
    app_print("[password]: The length should be between 8 and 63, but can be empty indicates open ap.\r\n");
    app_print("<srvaddr>: IPv4 address of remote OTA server needded to set. eg: 192.168.0.123.\r\n");
    app_print("<imageurl>: The length should be between 1 and 127.\r\n");
    app_print("for example:\r\n");
    app_print("    ota_demo test_ap 192.168.3.100 image-ota.bin, means connect to an open AP\r\n");
    app_print("\t\t\tand update the image-ota.bin from 192.168.3.100.\r\n");
}
#endif

#if NVDS_FLASH_SUPPORT
static int nvds_hex_para(char *argv, char *para, uint16_t *para_len, uint16_t max_len)
{
    uint16_t offset, hex_len;
    char str[3];

    hex_len = (strlen(argv) - 3) / 2 + 1;
    if (hex_len > max_len)
        return -1;

    offset = hex_len - 1;
    for (int i = strlen(argv) - 1; i >= 2; i = i - 2) {
        if (i <= 2) {
            str[0] = argv[i];
            str[1] = '\0';
            para[offset--] = strtoul(str, NULL, 16);
        } else {
            str[0] = argv[i - 1];
            str[1] = argv[i];
            str[2] = '\0';
            para[offset--] = strtoul(str, NULL, 16);
        }
    }

    para[hex_len] = '\0';
    *para_len = hex_len;

    #if 0
    for(int i = 0; i < hex_len; i++)
        app_print("0x%02x ", para[i]);
    app_print("\r\n");
    #endif
    return 0;
}

/**
 ****************************************************************************************
 * @brief Process function for 'nvds' command
 *
 * nvds command can be used to clean/add/del/show nvds flash data
 *
   @verbatim
     nvds clean : Erase internal nvds flash
     nvds add namespace key value : Save data to nvds flash.
     nvds del namespace key : Delete data in nvds flash.
     nvds dump : Show all valid data stored in nvds flash.
     nvds dump verbose : Show all data include invalid stored in nvds flash.
     nvds dump namespace : Show all data in the specified namespace.
     nvds dump namespace key : Show data by specified namespace and key.
   @endverbatim
 *
 * @param[in] params clean/add/del/show commands above
 ****************************************************************************************
 */
static void cmd_nvds_handle(int argc, char **argv)
{
    char *option, *ns;
    int ret;
    char key[16], value[256];
    uint16_t key_len;
    uint16_t value_len;
    uint32_t length;
    uint8_t *buffer;

    if (argc < 2)
        goto usage;

    option = argv[1];
    if (!strcmp("clean", option)) {
        ret = nvds_clean(NULL);
        if (ret)
            app_print("NVDS flash erase failed, error code:%d\r\n", ret);
        else
            app_print("NVDS flash erase ok.\r\n");
    } else if (!strcmp("add", option)) {
        if (argc < 5)
            goto usage;

        // namespace
        ns = argv[2];
        if (strlen(ns) > 15) {
            app_print("Illeagl namespace, Maximum length is 15 characters.\r\n");
            goto usage;
        }

        // key
        if (!memcmp("0x", argv[3], 2)) {
            ret = nvds_hex_para(argv[3], key, &key_len, 15);
            if (ret) {
                app_print("Illeagl key, Maximum length is 15 characters.\r\n");
                goto usage;
            }
        } else {
            key_len = strlen(argv[3]) + 1;
            if (strlen(argv[3]) > 15) {
                app_print("Illeagl key, Maximum length is 15 characters.\r\n");
                goto usage;
            }
            memcpy(key, argv[3], key_len);
        }

        // value
        if (!memcmp("0x", argv[4], 2)) {
            ret = nvds_hex_para(argv[4], value, &value_len, 255);
            if (ret) {
                app_print("Illeagl value, Maximum length is 255 characters.\r\n");
                goto usage;
            }
        } else {
            value_len = strlen(argv[4]) + 1;
            if (strlen(argv[4]) > 255) {
                app_print("Illeagl value, Maximum length is 255 characters.\r\n");
                goto usage;
            }
            memcpy(value, argv[4], value_len);
        }

        ret = nvds_data_put(NULL, ns, key, (uint8_t*)value, value_len);
        if (ret)
            app_print("NVDS flash add key failed, error code:%d\r\n", ret);
        else
            app_print("NVDS flash add key ok\r\n");
    } else if (!strcmp("del", option)) {
        if (argc < 3)
            goto usage;

        // namespace
        ns = argv[2];
        if (strlen(ns) > 15) {
            app_print("Illeagl namespace, Maximum length is 15 characters.\r\n");
            goto usage;
        }

        if (argc == 3) {
            ret = nvds_del_keys_by_namespace(NULL, ns);
        } else {
            // key
            if (!memcmp("0x", argv[3], 2)) {
                ret = nvds_hex_para(argv[3], key, &key_len, 15);
                if (ret) {
                    app_print("Illeagl key, Maximum length is 15 characters.\r\n");
                    goto usage;
                }
            } else {
                key_len = strlen(argv[3]) + 1;
                if (strlen(argv[3]) > 15) {
                    app_print("Illeagl key, Maximum length is 15 characters.\r\n");
                    goto usage;
                }
                memcpy(key, argv[3], key_len);
            }

            ret = nvds_data_del(NULL, ns, key);
        }

        if (ret)
            app_print("NVDS flash delete key failed, error code:%d\r\n", ret);
        else
            app_print("NVDS flash delete key ok\r\n");
    } else if (!strcmp("dump", option)) {
        if (argc == 2) {
            nvds_dump(NULL, 0, NULL);
        } else {
            if (!strcmp("verbose", argv[2])) {
                nvds_dump(NULL, 1, NULL);
            } else {
                // namespace
                ns = argv[2];
                if (strlen(ns) > 15) {
                    app_print("Illeagl namespace, Maximum length is 15 characters.\r\n");
                    goto usage;
                }
                if (argc == 3) {
                    nvds_dump(NULL, 0, ns);
                }

