tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/app/cmd_shell.c
                if (argc > 3) {
                    // key
                    if (!memcmp("0x", argv[3], 2)) {
                        ret = nvds_hex_para(argv[3], key, &key_len, 15);
                        if (ret) {
                            app_print("Illeagl key, Maximum length is 15 characters.\r\n");
                            goto usage;
                        }
                    } else {
                        key_len = strlen(argv[3]) + 1;
                        if (strlen(argv[3]) > 15) {
                            app_print("Illeagl key, Maximum length is 15 characters.\r\n");
                            goto usage;
                        }
                        memcpy(key, argv[3], key_len);
                    }

                    length = 0;
                    ret = nvds_data_get(NULL, ns, key, NULL, &length);
                    if (ret) {
                        app_print("NVDS flash get length failed, error code:%d\r\n", ret);
                        goto usage;
                    }
                    buffer = sys_malloc(length  + 1);
                    ret = nvds_data_get(NULL, ns, key, buffer, &length);
                    if (ret) {
                        app_print("NVDS flash get key value failed, error code:%d\r\n", ret);
                        goto usage;
                    } else {
                        app_print("NVDS flash get key: %s, value(str):%s, value(hex):", key, (char*)buffer);
                        for(int i = 0; i < length; i++) {
                            app_print("%02x ", buffer[i]);
                        }
                        app_print("\r\n");
                    }
                    sys_mfree(buffer);
                }
            }
        }
    } else {
        goto usage;
    }
    return;
usage:
    app_print("Usage: nvds clean | add | del | dump [options]\r\n");
    app_print("     : nvds clean : Erase internal nvds flash.\r\n");
    app_print("     : nvds add <namespace> <key> <value> : Save data to nvds flash.\r\n");
    app_print("     : nvds del <namespace> <key> : Delete data in nvds flash.\r\n");
    app_print("     : nvds del <namespace> : Delete all the data in the specified namespace.\r\n");
    app_print("     : nvds dump : Show all valid data stored in nvds flash.\r\n");
    app_print("     : nvds dump verbose : Show all data include invalid stored in nvds flash.\r\n");
    app_print("     : nvds dump <namespace> : Show all data in the specified namespace.\r\n");
    app_print("     : nvds dump <namespace> <key> : Show data by specified namespace and key.\r\n");
    app_print("     : Hexadecimals parmeter starts with 0x, else string.\r\n");
    app_print("Example:\r\n");
    app_print("     : nvds add wifi ip 0xc0a80064\r\n");
    app_print("     : nvds add wifi ssid gigadevice\r\n");
}
#endif /* NVDS_FLASH_SUPPORT */

#ifdef CONFIG_FATFS_SUPPORT
/*!
    \brief      fatfs related operation
    \param[in]  argc: number of parameters
    \param[in]  argv: the pointer to the array that holds the parameters
    \param[out] none
    \retval     none
*/
void cmd_fatfs(int argc, char **argv)
{

    if(argc >= 2 && argc <= 5){
        if (cmd_fatfs_exec(argc, argv) == 0)
            return;
    }
    app_print("\r\nUsage:\r\n");
    app_print("    fatfs create <path | path/filename>(path should end with \\ or /)\r\n");
    app_print("    fatfs append <path/filename> <string>\r\n");
    app_print("    fatfs read   <path/filename> [length] [offset]\r\n");
    app_print("    fatfs rename <path/filename> <[path/]new filename>\r\n");
    app_print("    fatfs delete <path | path/filename>\r\n");
    app_print("    fatfs show   [dir]\r\n");
    app_print("    Example: fatfs create a/b/c/d/ | fatfs create a/b/c/d.txt\r\n");
}
#endif

#ifdef USE_QSPI_FLASH
extern void qspi_flash_chip_erase(void);
static void cmd_qspi_flash_chip_erase(int argc, char **argv)
{
    qspi_flash_chip_erase();
    app_print("cmd_qspi_flash_chip_erase done! \r\n");
}
#endif

static void cmd_image_switch(int argc, char **argv)
{
    uint8_t running_idx = 0;
    uint32_t res = 0;

    res = rom_sys_status_get(SYS_RUNNING_IMG, LEN_SYS_RUNNING_IMG, &running_idx);

    res = rom_sys_set_img_flag(running_idx, (IMG_FLAG_IA_MASK | IMG_FLAG_NEWER_MASK), (IMG_FLAG_IA_OK | IMG_FLAG_OLDER));
    res |= rom_sys_set_img_flag(!running_idx, (IMG_FLAG_IA_MASK | IMG_FLAG_VERIFY_MASK | IMG_FLAG_NEWER_MASK), 0);
    res |= rom_sys_set_img_flag(!running_idx, IMG_FLAG_NEWER_MASK, IMG_FLAG_NEWER);

    if (res != 0) {
        app_print("Set sys image status failed(res = %d), switch image failed!\r\n", res);
        return;
    }

    app_print("Switch image successful, please reboot now!\r\n");
    return;
}

// Array of supported CLI command
static const struct cmd_entry cmd_table[] =
{
    {"help", cmd_help},
    {"reboot", cmd_reboot},
    {"version", cmd_version},
#ifdef USE_QSPI_FLASH
    {"qspi_flash_chip_erase", cmd_qspi_flash_chip_erase},
#endif

#ifdef CONFIG_FATFS_SUPPORT
    {"fatfs", cmd_fatfs},
#endif
    {"rmem", cmd_read_memory},
#ifdef CONFIG_BASECMD
    {"tasks", cmd_task_list},
    {"free", cmd_free},
    {"sys_ps", cmd_sys_ps},
    {"cpu_stats", cmd_cpu_stats},
    {"ps_stats", cmd_ps_stats},
    {"xmodem", cmd_xmodem},
#ifdef CFG_WLAN_SUPPORT
    {"ping", cmd_ping},
    {"join_group", cmd_group_join},
#ifdef CONFIG_SSL_TEST
    {"ssl_client", cmd_ssl_client},
#endif
#ifdef CONFIG_IPERF_TEST
    {"iperf", cmd_iperf},
#endif
#ifdef CONFIG_IPERF3_TEST
    {"iperf3", cmd_iperf3},
#endif
#ifdef CONFIG_OTA_DEMO_SUPPORT
    {"ota_demo", cmd_ota_demo},
#endif
#if LWIP_STATS && LWIP_STATS_DISPLAY
    {"lwip_stats", cmd_lwip_stats},
#endif
    {"wifi_debug", cmd_wifi_debug},
    {"wifi_open", cmd_wifi_open},
    {"wifi_close", cmd_wifi_close},
    {"wifi_mac_addr", cmd_wifi_mac_addr},
#ifdef CFG_WIFI_CONCURRENT
    {"wifi_concurrent", cmd_wifi_concurrent},
#endif
    {"wifi_auto_conn", cmd_wifi_auto_conn},
    {"wifi_wireless_mode", cmd_wifi_wireless_mode},
    {"wifi_roaming", cmd_wifi_roaming},
    {"wifi_scan", cmd_wifi_scan},
    {"wifi_connect", cmd_wifi_connect},
    {"wifi_connect_bssid", cmd_wifi_connect_bssid},
#ifdef CFG_8021x_EAP_TLS
    {"wifi_connect_eap_tls", cmd_wifi_connect_eap_tls},
#endif /* CFG_8021x_EAP_TLS */
    {"wifi_disconnect", cmd_wifi_disconnect},
    {"wifi_status", cmd_wifi_status},
    {"wifi_set_ip", cmd_wifi_ip_set},
#ifdef CFG_LPS
    {"wifi_ps", cmd_wifi_ps},
    {"wifi_listen_interval", cmd_wifi_listen_interval_set},
#endif

#ifdef CFG_TWT
    {"wifi_setup_twt", cmd_wifi_twt_setup},
    {"wifi_teardown_twt", cmd_wifi_twt_teardown},
#endif

    {"wifi_monitor", cmd_wifi_monitor},
#ifdef CFG_SOFTAP
    {"wifi_ap", cmd_wifi_ap},
    {"wifi_ap_client_delete", cmd_wifi_ap_client_delete},
    {"wifi_stop_ap", cmd_wifi_ap_stop},
#endif /* CFG_SOFTAP */
#ifdef CONFIG_SOFTAP_PROVISIONING
    {"wifi_ap_provisioning", cmd_wifi_ap_provisioning},
#endif

#ifdef CFG_WPS
    {"wifi_wps", cmd_wifi_wps},
#endif /* CFG_WPS */
#ifdef CONFIG_MQTT
    {"mqtt", cmd_mqtt},
#endif /*CONFIG_MQTT*/
#ifdef CONFIG_COAP
    {"coap_client", cmd_coap_client},
    {"coap_server", cmd_coap_server},
#endif
#ifdef CONFIG_LWIP_SOCKETS_TEST
    {"socket_client", cmd_lwip_sockets_client},
    {"socket_server", cmd_lwip_sockets_server},
    {"socket_close", cmd_lwip_sockets_close},
    {"socket_get_status", cmd_lwip_sockets_get_status},
#endif
#endif /* CFG_WLAN_SUPPORT */
#if NVDS_FLASH_SUPPORT
    {"nvds", cmd_nvds_handle},
#endif /* NVDS_FLASH_SUPPORT */
    {"image_switch", cmd_image_switch},
#endif /* CONFIG_BASECMD */

    {"", NULL}
};

#if 0//def CONFIG_ATCMD
static void at_cmd_exec(struct cmd_msg *msg)
{
    int argc;
    char *argv[MAX_ARGC];
    char *command;
    cmd_handle_cb handle_cb = NULL;
    struct cmd_module_reg_info * atcmd_tab_info = &(cmd_info.cmd_reg_infos[CMD_MODULE_ATCMD]);

    command = sys_malloc(msg->len);
    uart_cmd_rx_handle_done((cyclic_buf_t *)msg->data, (uint8_t *)command, &msg->len);

    if (command == NULL)
    {
        app_print("No buffer alloc for at cmd ! \r\n");
        return;
    }

